package day01;

/*
    标识符：给类、接口、常量、方法等起名字时用的规则
    起名规则：
        1、由英文大小写组成
        2、可以有数字，但数字不能开头
        3、除了&和_两个特殊字符，其它特殊字符均不可出现

    常见起名字的地方：
        包(其实就是文件夹，用于解决相同类名问题)
            全部由小写字母组成，多个包之间的嵌套关系使用.  举例：com.shujia.wyh.day01
        类或者接口
            一个单词构成：首字母大写，其余字母小写     eg: Clazz
            两个及以上单词构成：首字母均大写，其余字母小写     eg: KeyWord

        方法和变量
            一个单词构成：字母全部小写   eg: max()
            两个及以上单词构成：第一个单词全部小写，第二个单词首字母大写  eg: playGame()

        常量
            一个单词构成：字母全部大写   eg: NAME
            两个及以上单词构成：字母全部大写，单词和单词之间使用_连接   eg: FIRST_NAME
*/

public class MakeName {
}
